In [137]:
import pandas as pd

In [138]:
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [139]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Dhaka', 'Chittagong', 'Khulna']
}
df = pd.DataFrame(data)
print(df)

      Name  Age        City
0    Alice   25       Dhaka
1      Bob   30  Chittagong
2  Charlie   35      Khulna

In [140]:
df = pd.read_csv('https://raw.githubusercontent.com/Tanvir4n/Data-Science/refs/heads/main/full_data_1000.csv')  # replace with actual file path
print(df.head())

      Name  Age                  City         Full Name  Department  Salary  \
0    Erica   55       East Coreymouth       Erica Riley          IT   79044
1  Kenneth   21  North Elizabethville  Kenneth Williams  Operations   67003
2    Kevin   53       East Rubenville        Kevin Sims     Finance   40877
3  Felicia   55             Tylerland     Felicia Price  Operations   88578
4  Jeffrey   28           Ellisonport    Jeffrey Baxter  Operations   31078

    Join Date
0  2015-12-30
1  2020-09-15
2  2018-04-27
3  2018-10-20
4  2015-09-05

In [141]:
df.to_csv('output.csv', index=False)

In [142]:
print(df.head())

      Name  Age                  City         Full Name  Department  Salary  \
0    Erica   55       East Coreymouth       Erica Riley          IT   79044
1  Kenneth   21  North Elizabethville  Kenneth Williams  Operations   67003
2    Kevin   53       East Rubenville        Kevin Sims     Finance   40877
3  Felicia   55             Tylerland     Felicia Price  Operations   88578
4  Jeffrey   28           Ellisonport    Jeffrey Baxter  Operations   31078

    Join Date
0  2015-12-30
1  2020-09-15
2  2018-04-27
3  2018-10-20
4  2015-09-05

In [143]:
print(df.tail())

         Name  Age            City           Full Name Department  Salary  \
995     Julia   54     West Andrea         Julia Ellis    Finance   81521
996    Joshua   58          Listad     Joshua Martinez         IT   31002
997  Michelle   44      Tanyamouth      Michelle James    Finance   84397
998    Joshua   20  Lake Lauratown        Joshua Kelly         HR   71352
999  Margaret   35    East Brandon  Margaret Fernandez  Marketing   71134

      Join Date
995  2019-05-04
996  2022-11-27
997  2021-06-25
998  2017-04-21
999  2023-09-25

In [144]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        1000 non-null   object
 1   Age         1000 non-null   int64
 2   City        1000 non-null   object
 3   Full Name   1000 non-null   object
 4   Department  1000 non-null   object
 5   Salary      1000 non-null   int64
 6   Join Date   1000 non-null   object
dtypes: int64(2), object(5)
memory usage: 54.8+ KB
None

In [145]:
print(df.describe())

               Age        Salary
count  1000.000000   1000.000000
mean     40.231000  63460.307000
std      11.668496  20474.631841
min      20.000000  30043.000000
25%      30.000000  45375.000000
50%      40.000000  63083.000000
75%      50.000000  80039.500000
max      60.000000  99935.000000

In [146]:
print(df['Name'])

0         Erica
1       Kenneth
2         Kevin
3       Felicia
4       Jeffrey
         ...
995       Julia
996      Joshua
997    Michelle
998      Joshua
999    Margaret
Name: Name, Length: 1000, dtype: object

In [147]:
print(df.loc[0])

Name                    Erica
Age                        55
City          East Coreymouth
Full Name         Erica Riley
Department                 IT
Salary                  79044
Join Date          2015-12-30
Name: 0, dtype: object

In [148]:
print(df.iloc[0])

Name                    Erica
Age                        55
City          East Coreymouth
Full Name         Erica Riley
Department                 IT
Salary                  79044
Join Date          2015-12-30
Name: 0, dtype: object

In [149]:
print(df[df['Age'] > 25])

         Name  Age             City           Full Name  Department  Salary  \
0       Erica   55  East Coreymouth         Erica Riley          IT   79044
2       Kevin   53  East Rubenville          Kevin Sims     Finance   40877
3     Felicia   55        Tylerland       Felicia Price  Operations   88578
4     Jeffrey   28      Ellisonport      Jeffrey Baxter  Operations   31078
5       Derek   36    Hernandezport     Derek Davenport  Operations   38625
..        ...  ...              ...                 ...         ...     ...
994    Rhonda   40      Lake Robert     Rhonda Griffith          IT   95957
995     Julia   54      West Andrea         Julia Ellis     Finance   81521
996    Joshua   58           Listad     Joshua Martinez          IT   31002
997  Michelle   44       Tanyamouth      Michelle James     Finance   84397
999  Margaret   35     East Brandon  Margaret Fernandez   Marketing   71134

      Join Date
0    2015-12-30
2    2018-04-27
3    2018-10-20
4    2015-09-05
5    2020-01-30
..          ...
994  2018-01-27
995  2019-05-04
996  2022-11-27
997  2021-06-25
999  2023-09-25

[861 rows x 7 columns]

In [150]:
#df['Salary'] = [50000, 60000, 70000]
df['Salary'] = 80800  # Assigns 80800 to all 1080 rows
print(df)

         Name  Age                  City           Full Name  Department  \
0       Erica   55       East Coreymouth         Erica Riley          IT
1     Kenneth   21  North Elizabethville    Kenneth Williams  Operations
2       Kevin   53       East Rubenville          Kevin Sims     Finance
3     Felicia   55             Tylerland       Felicia Price  Operations
4     Jeffrey   28           Ellisonport      Jeffrey Baxter  Operations
..        ...  ...                   ...                 ...         ...
995     Julia   54           West Andrea         Julia Ellis     Finance
996    Joshua   58                Listad     Joshua Martinez          IT
997  Michelle   44            Tanyamouth      Michelle James     Finance
998    Joshua   20        Lake Lauratown        Joshua Kelly          HR
999  Margaret   35          East Brandon  Margaret Fernandez   Marketing

     Salary   Join Date
0     80800  2015-12-30
1     80800  2020-09-15
2     80800  2018-04-27
3     80800  2018-10-20
4     80800  2015-09-05
..      ...         ...
995   80800  2019-05-04
996   80800  2022-11-27
997   80800  2021-06-25
998   80800  2017-04-21
999   80800  2023-09-25

[1000 rows x 7 columns]

In [151]:
df = df.drop(columns=['City'])
print(df)

         Name  Age           Full Name  Department  Salary   Join Date
0       Erica   55         Erica Riley          IT   80800  2015-12-30
1     Kenneth   21    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin   53          Kevin Sims     Finance   80800  2018-04-27
3     Felicia   55       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey   28      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...  ...                 ...         ...     ...         ...
995     Julia   54         Julia Ellis     Finance   80800  2019-05-04
996    Joshua   58     Joshua Martinez          IT   80800  2022-11-27
997  Michelle   44      Michelle James     Finance   80800  2021-06-25
998    Joshua   20        Joshua Kelly          HR   80800  2017-04-21
999  Margaret   35  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [152]:
df = df.rename(columns={'Name': 'Full Name'})
print(df)

    Full Name  Age           Full Name  Department  Salary   Join Date
0       Erica   55         Erica Riley          IT   80800  2015-12-30
1     Kenneth   21    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin   53          Kevin Sims     Finance   80800  2018-04-27
3     Felicia   55       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey   28      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...  ...                 ...         ...     ...         ...
995     Julia   54         Julia Ellis     Finance   80800  2019-05-04
996    Joshua   58     Joshua Martinez          IT   80800  2022-11-27
997  Michelle   44      Michelle James     Finance   80800  2021-06-25
998    Joshua   20        Joshua Kelly          HR   80800  2017-04-21
999  Margaret   35  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [153]:
df['Full Name'] = df['Full Name'].replace('Alice', 'Alicia')
print(df)

    Full Name  Age           Full Name  Department  Salary   Join Date
0       Erica   55         Erica Riley          IT   80800  2015-12-30
1     Kenneth   21    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin   53          Kevin Sims     Finance   80800  2018-04-27
3     Felicia   55       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey   28      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...  ...                 ...         ...     ...         ...
995     Julia   54         Julia Ellis     Finance   80800  2019-05-04
996    Joshua   58     Joshua Martinez          IT   80800  2022-11-27
997  Michelle   44      Michelle James     Finance   80800  2021-06-25
998    Joshua   20        Joshua Kelly          HR   80800  2017-04-21
999  Margaret   35  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [154]:
df.fillna(value='Unknown', inplace=True)
print(df)

    Full Name  Age           Full Name  Department  Salary   Join Date
0       Erica   55         Erica Riley          IT   80800  2015-12-30
1     Kenneth   21    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin   53          Kevin Sims     Finance   80800  2018-04-27
3     Felicia   55       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey   28      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...  ...                 ...         ...     ...         ...
995     Julia   54         Julia Ellis     Finance   80800  2019-05-04
996    Joshua   58     Joshua Martinez          IT   80800  2022-11-27
997  Michelle   44      Michelle James     Finance   80800  2021-06-25
998    Joshua   20        Joshua Kelly          HR   80800  2017-04-21
999  Margaret   35  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [155]:
df = df.dropna()
print(df)

    Full Name  Age           Full Name  Department  Salary   Join Date
0       Erica   55         Erica Riley          IT   80800  2015-12-30
1     Kenneth   21    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin   53          Kevin Sims     Finance   80800  2018-04-27
3     Felicia   55       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey   28      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...  ...                 ...         ...     ...         ...
995     Julia   54         Julia Ellis     Finance   80800  2019-05-04
996    Joshua   58     Joshua Martinez          IT   80800  2022-11-27
997  Michelle   44      Michelle James     Finance   80800  2021-06-25
998    Joshua   20        Joshua Kelly          HR   80800  2017-04-21
999  Margaret   35  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [156]:
df['Age'] = df['Age'].astype(float)
print(df.dtypes)

Full Name      object
Age           float64
Full Name      object
Department     object
Salary          int64
Join Date      object
dtype: object

In [157]:
print(df.sort_values(by='Age'))

     Full Name   Age        Full Name  Department  Salary   Join Date
70    Jennifer  20.0  Jennifer Hebert          IT   80800  2020-11-04
58   Frederick  20.0  Frederick Boyer  Operations   80800  2024-02-22
897     Samuel  20.0     Samuel Perez  Operations   80800  2015-08-09
715     Parker  20.0     Parker Lopez  Operations   80800  2024-09-10
966     Marcus  20.0     Marcus Cowan   Marketing   80800  2015-05-12
..         ...   ...              ...         ...     ...         ...
197      Julie  60.0     Julie Martin          HR   80800  2022-10-10
164      David  60.0    David Ellison          IT   80800  2019-09-15
77    Angelica  60.0   Angelica Perez  Operations   80800  2022-01-20
85       Tonya  60.0      Tonya Kelly          IT   80800  2021-04-09
84       David  60.0     David Garcia     Finance   80800  2024-07-23

[1000 rows x 6 columns]

In [158]:
df = df.reset_index(drop=True)
print(df)

    Full Name   Age           Full Name  Department  Salary   Join Date
0       Erica  55.0         Erica Riley          IT   80800  2015-12-30
1     Kenneth  21.0    Kenneth Williams  Operations   80800  2020-09-15
2       Kevin  53.0          Kevin Sims     Finance   80800  2018-04-27
3     Felicia  55.0       Felicia Price  Operations   80800  2018-10-20
4     Jeffrey  28.0      Jeffrey Baxter  Operations   80800  2015-09-05
..        ...   ...                 ...         ...     ...         ...
995     Julia  54.0         Julia Ellis     Finance   80800  2019-05-04
996    Joshua  58.0     Joshua Martinez          IT   80800  2022-11-27
997  Michelle  44.0      Michelle James     Finance   80800  2021-06-25
998    Joshua  20.0        Joshua Kelly          HR   80800  2017-04-21
999  Margaret  35.0  Margaret Fernandez   Marketing   80800  2023-09-25

[1000 rows x 6 columns]

In [159]:
df = df.set_index('Full Name')
print(df)

                                 Age  Department  Salary   Join Date
Full Name
(Erica, Erica Riley)            55.0          IT   80800  2015-12-30
(Kenneth, Kenneth Williams)     21.0  Operations   80800  2020-09-15
(Kevin, Kevin Sims)             53.0     Finance   80800  2018-04-27
(Felicia, Felicia Price)        55.0  Operations   80800  2018-10-20
(Jeffrey, Jeffrey Baxter)       28.0  Operations   80800  2015-09-05
...                              ...         ...     ...         ...
(Julia, Julia Ellis)            54.0     Finance   80800  2019-05-04
(Joshua, Joshua Martinez)       58.0          IT   80800  2022-11-27
(Michelle, Michelle James)      44.0     Finance   80800  2021-06-25
(Joshua, Joshua Kelly)          20.0          HR   80800  2017-04-21
(Margaret, Margaret Fernandez)  35.0   Marketing   80800  2023-09-25

[1000 rows x 4 columns]

In [160]:
df['Age Plus 5'] = df['Age'].apply(lambda x: x + 5)
print(df)

                                 Age  Department  Salary   Join Date  \
Full Name
(Erica, Erica Riley)            55.0          IT   80800  2015-12-30
(Kenneth, Kenneth Williams)     21.0  Operations   80800  2020-09-15
(Kevin, Kevin Sims)             53.0     Finance   80800  2018-04-27
(Felicia, Felicia Price)        55.0  Operations   80800  2018-10-20
(Jeffrey, Jeffrey Baxter)       28.0  Operations   80800  2015-09-05
...                              ...         ...     ...         ...
(Julia, Julia Ellis)            54.0     Finance   80800  2019-05-04
(Joshua, Joshua Martinez)       58.0          IT   80800  2022-11-27
(Michelle, Michelle James)      44.0     Finance   80800  2021-06-25
(Joshua, Joshua Kelly)          20.0          HR   80800  2017-04-21
(Margaret, Margaret Fernandez)  35.0   Marketing   80800  2023-09-25

                                Age Plus 5
Full Name
(Erica, Erica Riley)                  60.0
(Kenneth, Kenneth Williams)           26.0
(Kevin, Kevin Sims)                   58.0
(Felicia, Felicia Price)              60.0
(Jeffrey, Jeffrey Baxter)             33.0
...                                    ...
(Julia, Julia Ellis)                  59.0
(Joshua, Joshua Martinez)             63.0
(Michelle, Michelle James)            49.0
(Joshua, Joshua Kelly)                25.0
(Margaret, Margaret Fernandez)        40.0

[1000 rows x 5 columns]

In [161]:
grouped = df.groupby('Age').mean(numeric_only=True)
print(grouped)

       Salary  Age Plus 5
Age
20.0  80800.0        25.0
21.0  80800.0        26.0
22.0  80800.0        27.0
23.0  80800.0        28.0
24.0  80800.0        29.0
25.0  80800.0        30.0
26.0  80800.0        31.0
27.0  80800.0        32.0
28.0  80800.0        33.0
29.0  80800.0        34.0
30.0  80800.0        35.0
31.0  80800.0        36.0
32.0  80800.0        37.0
33.0  80800.0        38.0
34.0  80800.0        39.0
35.0  80800.0        40.0
36.0  80800.0        41.0
37.0  80800.0        42.0
38.0  80800.0        43.0
39.0  80800.0        44.0
40.0  80800.0        45.0
41.0  80800.0        46.0
42.0  80800.0        47.0
43.0  80800.0        48.0
44.0  80800.0        49.0
45.0  80800.0        50.0
46.0  80800.0        51.0
47.0  80800.0        52.0
48.0  80800.0        53.0
49.0  80800.0        54.0
50.0  80800.0        55.0
51.0  80800.0        56.0
52.0  80800.0        57.0
53.0  80800.0        58.0
54.0  80800.0        59.0
55.0  80800.0        60.0
56.0  80800.0        61.0
57.0  80800.0        62.0
58.0  80800.0        63.0
59.0  80800.0        64.0
60.0  80800.0        65.0

In [162]:
df2 = pd.DataFrame({'Full Name': ['David'], 'Age': [28], 'Salary': [65000]})
df_combined = pd.concat([df, df2], ignore_index=True)
print(df_combined)

       Age  Department  Salary   Join Date  Age Plus 5 Full Name
0     55.0          IT   80800  2015-12-30        60.0       NaN
1     21.0  Operations   80800  2020-09-15        26.0       NaN
2     53.0     Finance   80800  2018-04-27        58.0       NaN
3     55.0  Operations   80800  2018-10-20        60.0       NaN
4     28.0  Operations   80800  2015-09-05        33.0       NaN
...    ...         ...     ...         ...         ...       ...
996   58.0          IT   80800  2022-11-27        63.0       NaN
997   44.0     Finance   80800  2021-06-25        49.0       NaN
998   20.0          HR   80800  2017-04-21        25.0       NaN
999   35.0   Marketing   80800  2023-09-25        40.0       NaN
1000  28.0         NaN   65000         NaN         NaN     David

[1001 rows x 6 columns]

In [163]:
df3 = pd.DataFrame({'Full Name': ['Alice', 'Bob'], 'Department': ['HR', 'IT']})
df_merged = pd.merge(df, df3, on='Full Name', how='left')
print(df_merged)

                          Full Name   Age Department_x  Salary   Join Date  \
0              (Erica, Erica Riley)  55.0           IT   80800  2015-12-30
1       (Kenneth, Kenneth Williams)  21.0   Operations   80800  2020-09-15
2               (Kevin, Kevin Sims)  53.0      Finance   80800  2018-04-27
3          (Felicia, Felicia Price)  55.0   Operations   80800  2018-10-20
4         (Jeffrey, Jeffrey Baxter)  28.0   Operations   80800  2015-09-05
..                              ...   ...          ...     ...         ...
995            (Julia, Julia Ellis)  54.0      Finance   80800  2019-05-04
996       (Joshua, Joshua Martinez)  58.0           IT   80800  2022-11-27
997      (Michelle, Michelle James)  44.0      Finance   80800  2021-06-25
998          (Joshua, Joshua Kelly)  20.0           HR   80800  2017-04-21
999  (Margaret, Margaret Fernandez)  35.0    Marketing   80800  2023-09-25

     Age Plus 5 Department_y
0          60.0          NaN
1          26.0          NaN
2          58.0          NaN
3          60.0          NaN
4          33.0          NaN
..          ...          ...
995        59.0          NaN
996        63.0          NaN
997        49.0          NaN
998        25.0          NaN
999        40.0          NaN

[1000 rows x 7 columns]

In [164]:
pivot = df.pivot_table(values='Salary', index='Age', aggfunc='mean')
print(pivot)

       Salary
Age
20.0  80800.0
21.0  80800.0
22.0  80800.0
23.0  80800.0
24.0  80800.0
25.0  80800.0
26.0  80800.0
27.0  80800.0
28.0  80800.0
29.0  80800.0
30.0  80800.0
31.0  80800.0
32.0  80800.0
33.0  80800.0
34.0  80800.0
35.0  80800.0
36.0  80800.0
37.0  80800.0
38.0  80800.0
39.0  80800.0
40.0  80800.0
41.0  80800.0
42.0  80800.0
43.0  80800.0
44.0  80800.0
45.0  80800.0
46.0  80800.0
47.0  80800.0
48.0  80800.0
49.0  80800.0
50.0  80800.0
51.0  80800.0
52.0  80800.0
53.0  80800.0
54.0  80800.0
55.0  80800.0
56.0  80800.0
57.0  80800.0
58.0  80800.0
59.0  80800.0
60.0  80800.0

In [165]:
# Example: Assign dates to first two rows only
df['Join Date'] = pd.to_datetime('2021-01-01')  # Single date will be broadcast to all rows
print(df.dtypes)

Age                  float64
Department            object
Salary                 int64
Join Date     datetime64[ns]
Age Plus 5           float64
dtype: object

In [166]:
ts = pd.Series([1, 2, 3, 4], index=pd.date_range('20230101', periods=4, freq='D'))
print(ts.resample('2D').sum())

2023-01-01    3
2023-01-03    7
Freq: 2D, dtype: int64